content/threads.org
---
title: Quest Threads
---
* Taking Down Kiordan
- Mosquito Witch
- Find Womble and the docs
- Curse shop in Absalom has a curse-breaking department
- Truename: Recover Margaret's memories, peek about in there for the truename
* Genevieve
- Investigate Margaret's memories
- Specifically, the shape of the holes left by clean-slate fuckery
- Fill in those holes if we can
- Investigate the slate. Try to understand it's mind-affecting powers and undo them
- Read the cat's mind
- Fix the clean slate, and use it to erase her deadname
* Unanswered Questions
- Why was the jewel left in the town hall and not taken by the vampires? Were there actually no Kiordan vamps inside the city? Because there was just spawn and the avatar, was this some kind of remote-activated massacre?
- Or did we get to it before they could?

* Others
- Communicate with the house: Try a probe
- Undo vampirism
- Find Petey's parents, if they're alive
