public/threads/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>Quest Threads | Genevieve&#39;s Journal</title>
<meta name="title" content="Quest Threads" />
<meta name="description" content="Taking Down Kiordan Mosquito Witch Find Womble and the docs Curse shop in Absalom has a curse-breaking department Truename: Recover Margaret&#39;s memories, peek about in there for the truename Genevieve Investigate Margaret&#39;s memories Specifically, the shape of the holes left by clean-slate fuckery Fill in those holes if we can Investigate the slate. Try to understand it&#39;s mind-affecting powers and undo them Read the cat&#39;s mind Fix the clean slate, and use it to erase her deadname Unanswered Questions Why was the jewel left in the town hall and not taken by the vampires?" />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/threads/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="Quest Threads">
  <meta property="og:description" content="Taking Down Kiordan Mosquito Witch Find Womble and the docs Curse shop in Absalom has a curse-breaking department Truename: Recover Margaret&#39;s memories, peek about in there for the truename Genevieve Investigate Margaret&#39;s memories Specifically, the shape of the holes left by clean-slate fuckery Fill in those holes if we can Investigate the slate. Try to understand it&#39;s mind-affecting powers and undo them Read the cat&#39;s mind Fix the clean slate, and use it to erase her deadname Unanswered Questions Why was the jewel left in the town hall and not taken by the vampires?">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="Quest Threads">
  <meta name="twitter:description" content="Taking Down Kiordan Mosquito Witch Find Womble and the docs Curse shop in Absalom has a curse-breaking department Truename: Recover Margaret&#39;s memories, peek about in there for the truename Genevieve Investigate Margaret&#39;s memories Specifically, the shape of the holes left by clean-slate fuckery Fill in those holes if we can Investigate the slate. Try to understand it&#39;s mind-affecting powers and undo them Read the cat&#39;s mind Fix the clean slate, and use it to erase her deadname Unanswered Questions Why was the jewel left in the town hall and not taken by the vampires?">


  
  
  <meta itemprop="name" content="Quest Threads">
  <meta itemprop="description" content="Taking Down Kiordan Mosquito Witch Find Womble and the docs Curse shop in Absalom has a curse-breaking department Truename: Recover Margaret&#39;s memories, peek about in there for the truename Genevieve Investigate Margaret&#39;s memories Specifically, the shape of the holes left by clean-slate fuckery Fill in those holes if we can Investigate the slate. Try to understand it&#39;s mind-affecting powers and undo them Read the cat&#39;s mind Fix the clean slate, and use it to erase her deadname Unanswered Questions Why was the jewel left in the town hall and not taken by the vampires?">
  <meta itemprop="wordCount" content="143">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/threads">Quest Threads</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>Quest Threads</h1>
<p class="byline">
  <time datetime='0001-01-01' pubdate>
    0001-01-01
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Taking Down Kiordan
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>Mosquito Witch</li>
<li>Find Womble and the docs</li>
<li>Curse shop in Absalom has a curse-breaking department</li>
<li>Truename: Recover Margaret&#39;s memories, peek about in there for the truename</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Genevieve
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<ul>
<li>Investigate Margaret&#39;s memories</li>
<li>Specifically, the shape of the holes left by clean-slate fuckery</li>
<li>Fill in those holes if we can</li>
<li>Investigate the slate. Try to understand it&#39;s mind-affecting powers and undo them</li>
<li>Read the cat&#39;s mind</li>
<li>Fix the clean slate, and use it to erase her deadname</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Unanswered Questions
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>Why was the jewel left in the town hall and not taken by the vampires? Were there actually no Kiordan vamps inside the city? Because there was just spawn and the avatar, was this some kind of remote-activated massacre?</li>
<li>Or did we get to it before they could?</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Others
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<ul>
<li>Communicate with the house: Try a probe</li>
<li>Undo vampirism</li>
<li>Find Petey&#39;s parents, if they&#39;re alive</li>
</ul>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
